Dlubal.RFEM5.IneffectiveFoundationType
Type of ineffective foundation

Dlubal.RFEM5.IneffectiveFoundationType.UnknownIneffectivity
Unknown ineffective foundation

Dlubal.RFEM5.IneffectiveFoundationType.NoneIneffectivity
No ineffective foundation

Dlubal.RFEM5.IneffectiveFoundationType.NegativeConstantStressInZ
Failure if negative constant stress in z

Dlubal.RFEM5.IneffectiveFoundationType.PositiveConstantStressInZ
Failure if positive constant stress in z